[
  {"typ" : "para","content": "THIS AGREEMENT is made by and between CIOC FMCG Pvt Ltd, Kudlu, Bangalore 560068 ('CIOC') and {{customerName}}.<br/><br/>The parties agree as follows:"},
  {"typ" : "point","content": "<strong>General Purpose : </strong> The general purpose of this Agreement is to engage the services of CIOC to perform the services described in Schedule A."},
  {"typ" : "point","content": "<strong> General Duties of CIOC : </strong> CIOC shall perform in conformance with schedules attached as incorporated herein, and in conformance with professional standards for performing services of a similar kind. Whether or not the work of CIOC, or any part or segment thereof, conforms with such standards shall be determined solely by {{customerName}} will assign a representative ('{{customerName}} Representative') to provide direction to CIOC. CIOC may not replace or reassign such personnel without the prior written consent of {{customerName}}. If any such personnel leave CIOC's employ, CIOC shall replace personnel with a person having at least equivalent experience and qualifications. {{customerName}} shall have the right to review and approve such replacement personnel."},
  {"typ" : "point","content": "<strong> Term : </strong> The term of this Agreement shall be from {{startDate}} until {{endDate}}."},
  {"typ" : "point","content": "<strong> Timetable : </strong> The timetable set forth in the attached Schedule B shall be adhered to unless such period is otherwise extended by {{customerName}}. CIOC shall be responsible to {{customerName}} for any damage caused by the failure by CIOC to comply with the schedule."},
  {"typ" : "point","content": "<strong> Compensation : </strong> The payment terms and schedule of payments is set forth in the attached Schedule C."},
  {"typ" : "point","content": "<strong> Independent contrator : </strong> In the performance of the work hereunder, CIOC shall be an independent CIOC and not an employee of {{customerName}}. CIOC is not an agent of, or authorized to transact business, enter into agreements, or otherwise make commitments on behalf of {{customerName}} unless expressly authorized in writing by an officer of {{customerName}}. {{customerName}} will not pay or withhold national, state, or local income tax or other payroll tax of any kind on behalf of CIOC or its employees. CIOC is not eligible for, not entitled to, and shall not participate in any of {{customerName}}'s pension, health, or other benefit plans. CIOC is responsible for the payment of all required payroll taxes, whether national, state, or local in nature, including, but not limited to income taxes and any other fees, charges, licenses, or payments required by law. CIOC indemnifies {{customerName}} and holds it harmless against any fines, damages, assessments, or attorney fees in the event a court or administrative agency shall find that CIOC or anyone engaged through CIOC is an employee of {{customerName}}."},
  {"typ" : "point","content": "<strong> Confidentiality : </strong> All data and information in any format submitted or made available to CIOC by {{customerName}} or any other person on behalf of {{customerName}}, unless otherwise publicly available, and all data and information, and other work developed by CIOC under this Agreement, shall be utilized by CIOC solely in connection with the performance of services under this Agreement only and shall not be made available by CIOC to any other person."},
  {"typ" : "point","content": "<strong> Rights and License in and to {{customerName}} Data : </strong> {{customerName}} shall own all data, information, and other work product developed or obtained by CIOC pursuant to this Agreement. {{customerName}} shall at all times have access to review the ongoing work of CIOC for purposes of inspecting same and determining that work is being performed in accordance with the terms of this Agreement. Immediately upon termination of this Agreement for any reason, all such data, information, and other work, in whatever form, shall be turned over to {{customerName}}.<br/><br/>The parties agree that as between them, all rights including all intellectual property rights in and to data and information provided by {{customerName}} or on behalf of {{customerName}} or created by CIOC in the performance of services hereunder shall remain the exclusive property of {{customerName}}. CIOC has a limited, nonexclusive license to use such data and information solely for the purpose of performing its obligations under this Agreement. This Agreement does not give CIOC any rights, implied or otherwise, data, information, or intellectual property, except as expressly stated in this Agreement. <br/><br/> For purposes of this Agreement any copyrightable work ('Work') developed in the course of performance by CIOC under this Agreement shall be deemed 'work made for hire' under copyright law and all ownership rights to such work shall belong to {{customerName}}. Should such Work not constitute a 'work made for hire' under copyright law, CIOC hereby grants, transfers, assigns, and conveys to {{customerName}} and its successors and assigns, the entire right, title, and interest in the Work or any part thereof, including but not limited to the right to reproduce, prepare derivative works, distribute by sale, license or other transfer; to perform publicly, to display and to secure copyrights renewals, reissues, and extensions of any such copyrights or patents in the India or any foreign country.<br/><br/>Any patentable invention conceived or reduced to practice in the course of performance under this Agreement shall be the property of {{customerName}}. {{customerName}} has the right to secure patents, reissues and extensions of thereof in the India or any foreign country.<br/><br/>Whether a copyright or patent in the Work will be maintained or registered in the India or any foreign country shall be at the sole discretion of {{customerName}}. CIOC agrees to cooperate fully with {{customerName}} in the preparation and execution of all documents necessary or incidental to this assignment and the protection and preservation of rights herein granted to {{customerName}}."},
  {"typ" : "point","content": "<strong> Warranties : </strong> CIOC warrants and represents that services provided hereunder will not infringe, individually or collectively, any patent, copyright, trade secret, or other proprietary right of any third party; and CIOC has no reason to believe that any patent, copyright, trade secret, or other proprietary right of any third party may be infringed."},
  {"typ" : "point","content": "<strong> Data Security : </strong> All facilities and other resources used to store and/or process {{customerName}} Data will employ reasonable and appropriate administrative, physical, and technical safeguards, to secure such data from unauthorized access, disclosure, alteration, and use. Such measures will be no less protective than those used to secure CIOC’s own data of a similar type, and in no event less than reasonable in view of the type and nature of the data involved.<br/><br/>CIOC will use industry-standard and up-to-date security tools and technologies such as anti-virus protections and intrusion detection methods in providing services under this Agreement. CIOC will update its tools and technologies during the course of the Agreement as industry standards change and updated tools and technologies become available. CIOC will ensure that its employees, subCIOCs and agents who perform work under this Agreement receive appropriate instruction as to how to protect data consistent with the provisions of this Agreement. CIOC will perform background checks on all personnel who have potential to access {{customerName}} Data."},
  {"typ" : "point","content": "<strong>Access to Data in Response to Legal Demands or Requests for Data : </strong> {{customerName}} shall have the right, at all times during the term of the Agreement for any reason whatsoever in {{customerName}}'s sole discretion, to access, copy and/or remove any and all {{customerName}} data and information from CIOC. In addition, in connection with {{customerName}}'s response to an e-discovery request or other legal proceeding, governmental request, or other a claim or demand upon receipt of written request from {{customerName}}, CIOC will provide {{customerName}} with any existing logs or other {{customerName}} data and information.<br/><br/>If CIOC files a petition seeking to take advantage of any law relating to the bankruptcy or insolvency or is adjudicated to be bankrupt, or is the subject of a petition seeking liquidation, reorganization, winding-up, dissolution or adjustment of indebtedness, or if becomes insolvent or makes an assignment for the benefit of creditors or if a receiver is appointed, CIOC will return in a readily usable format, remove, or destroy, as directed by {{customerName}}, all {{customerName}} data and information. Upon receipt of valid legal process (the “Legal Request”) seeking {{customerName}}-related data or information, CIOC will attempt to redirect the requesting third party to {{customerName}} and/or request that the third party notify {{customerName}} of its Legal Request. If CIOC’s redirecting efforts are unsuccessful, and provided CIOC is not prohibited by law from doing so, CIOC will provide commercially reasonable notice to {{customerName}} of the Legal Request, prior to disclosure of any {{customerName}} Data, which would include, to the extent permitted by law, a copy of the Legal Request received by CIOC from the third party. CIOC will thereafter respond to the Legal Request in the time permitted unless {{customerName}} has taken appropriate legal steps (i.e., Motion to Quash or Motion for a Protective Order) to stop or limit CIOC’s response.<br/><br/>With respect to any legal process served on {{customerName}} for which {{customerName}} intends to respond, CIOC will provide {{customerName}} with access to any {{customerName}} Data in CIOC's possession together with any necessary encryption keys. If {{customerName}} is unable to access {{customerName}} Data using the tools and documentation provided by CIOC, then, upon request, CIOC will provide commercially reasonable assistance to enable {{customerName}} to obtain the {{customerName}} Data."},
  {"typ" : "point","content": "<strong> Waiver : </strong> A delay or failure by either party to exercise any right under this Agreement will not constitute a waiver of that or any similar or future right."},
  {"typ" : "point","content": "<strong> Assignment : </strong> This Agreement may not be assigned by CIOC without the express prior written permission of {{customerName}}, to be granted at {{customerName}}'s sole discretion."},
  {"typ" : "point","content": "<strong> Jurisdiction : </strong> This Agreement shall be deemed to have been made in the State of Karnataka State law (exclusive of any choice of law principles) shall govern this Agreement. CIOC consents to the jurisdiction of the state or national courts serving Bangalore City, Karnataka for the resolution of any disputes arising under this Agreement."},
  {"typ" : "point","content": "<strong> Advertisement : </strong> CIOC may use the name {{customerName}} or any variation thereof for advertising or publicity purposes without first obtaining the written permission of {{customerName}}. The {{customerName}} can prohibit CIOC from the same by providing written denial confirmation along with the signed contract document"},
  {"typ" : "point","content": "<strong> Notices : </strong> Each notice, request, or demand given or required to be given pursuant to this Agreement shall be in writing and shall be deemed sufficiently given if deposited in the India Post, first class, postage pre-paid, and addressed to the address of the intended recipient set forth on the first page hereof or to such other address as may be specified in writing by the parties."},
  {"typ" : "point","content": "<strong> Force Majeure : </strong> This Agreement is subject to cancellation or change on written notice to the CIOC or to {{customerName}} in the event of causes beyond {{customerName}}'s or CIOC's reasonable control, including without limitation acts of God or war, fires, earthquakes, floods, strikes, labor troubles, riots, curtailment or operations due to governmental orders or rulings, and the like."},
  {"typ" : "point","content": "<strong> Sale or Bankruptcy of CIOC’s Business : </strong> If, during the life of this Agreement, the CIOC disposes of its business by sale, transfer, force of law or by any means to another party, all obligations are transferred to such party. In the event, the new owner(s) may, in {{customerName}}'s absolute discretion, be required to submit a performance bond in the amount of the open balance of the Agreement. In the event of any suspension of payment or the institution of any proceedings by or against CIOC, voluntary or involuntary, in bankruptcy or insolvency, or under the provisions of the Bankruptcy Act in place, or for the appointment of a receiver or trustee or an assignee for the benefit of creditors of the property of CIOC, {{customerName}} shall have, in addition to the rights stated in the two preceding sentences, the right to cancel this Agreement forthwith."},
  {"typ" : "point","content": "<strong> Payment : </strong> CIOC shall be paid after receipt of properly prepared invoices in accordance with {{customerName}}'s invoicing instructions for Services delivered to and accepted by {{customerName}}. Any adjustments in CIOC's invoice due to shortages, rejection or other failure to comply with the provisions of the Agreement may be made by {{customerName}} before payment. Discount periods shall commence after the latest of final acceptance, delivery, receipt of any required documentation, or receipt of invoice. Delays in receiving the invoice, errors or omissions on the invoice, or lack of supporting documentation required by the terms of the Agreement, will be cause for withholding settlement without losing prompt payment discount privilege. Invoices must be accompanied by transportation receipt, if transportation is payable as a separate item. Original invoice shall be mailed or emailed immediately after each delivery in accordance with the instructions on the Purchase Order."},
  {"typ" : "point","content": "<strong> Right to Audit : </strong> Throughout the term of this Agreement, and for a period of three years after final payment, or longer if required by law, {{customerName}}, at its own expense, shall be entitled to perform, or to have performed by a third party of {{customerName}}’s choosing, during normal business hours and upon five (5) business days' notice, an on-site audit of any and all records of {{customerName}} necessary to permit {{customerName}} to evaluate and verify CIOC’s compliance with the requirements of this Agreement. CIOC grants {{customerName}} permission to view and/or copy any books, documents, records, data and information (including data and information stored in electronic form) of CIOC which relate to or have been used in connection with the performance of this Agreement. CIOC also grants {{customerName}} permission to interview CIOC’s staff and agents as part of the audit. CIOC agrees to provide {{customerName}} with adequate and appropriate workspace for conducting the audit. If {{customerName}}, in its sole discretion, determines that an on-site audit is not necessary, CIOC agrees to complete, within 30 days of receipt, an audit questionnaire provided by {{customerName}}. Any overcharges discovered by {{customerName}}, or by a third party of {{customerName}}’s choosing, shall be paid within 30 days of CIOC’s acceptance of {{customerName}}’s written notification of audit findings. CIOC may not unreasonably withhold acceptance of audit findings. CIOC shall include this audit provision in any subcontracts that it may issue under this Agreement."},
  {"typ" : "point","content": "<strong> Effective Date : </strong> The effective date of this agreement shall be the date of {{customerName}}'s signature."},
  {"typ" : "point","content": "<strong> Entire Agreement : </strong> This Agreement represents the entire understanding of the parties and may not be modified except by written agreement of the parties and supersedes all prior written and/or oral agreements."},
  {"typ" : "point","content": "<strong> Authority : </strong> Each party warrants that it has the authority to enter into this Agreement and that entering into this Agreement is not restricted or prohibited by any existing agreement to which it is a party."}
]
